In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('StudentsPerformance.csv')
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [3]:
df.shape

(1000, 8)

In [4]:
scores = df[['math score', 'reading score', 'writing score']]
scores.head()

   math score  reading score  writing score
0          72             72             74
1          69             90             88
2          90             95             93
3          47             57             44
4          76             78             75

In [5]:
math_score_array = np.array(scores['math score'])
reading_score_array = np.array(scores['reading score'])
writing_score_array = np.array(scores['writing score'])

In [6]:
total_scores = math_score_array + reading_score_array + writing_score_array

In [7]:
scores['total score'] = total_scores.tolist()
scores.head()

/home/mariam/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

   math score  reading score  writing score  total score
0          72             72             74          218
1          69             90             88          247
2          90             95             93          278
3          47             57             44          148
4          76             78             75          229

# Matrix methods' usage in data analysis

Matrices play a central role in data science: they are probably the most common way of representing data to be analyzed and manipulated by virtually any machine learning or analytics algorithm. Matrix algebra is used in a number of areas of machine learning field: regression algorithms, classification algorithms, optimisation and cost functions, dimension reduction algorithms.

In this example, I used matrix addition to calculate students' total scores with math, reading and writing scores.

### References

1.http://www.datasciencecourse.org/notes/matrices/

2.https://medium.com/fintechexplained/matrix-algebra-for-data-scientists-da0e33b93043